app/controllers/subscribers_controller.rb

SELECT `subscribers`.* FROM `subscribers`
---
	def index
		@subscribers = Subscriber.all

INSERT INTO `subscribers` (`created_at`, `updated_at`) VALUES ('2014-06-10 12:03:18', '2014-06-10 12:03:18')
---
	def create
		@subscriber = Subscriber.new(subscriber_params)
  		@subscriber.save

SELECT  `subscribers`.* FROM `subscribers`  WHERE `subscribers`.`id` = 1 LIMIT 1
---
	def show
		@subscriber = Subscriber.find(params[:id])